In [7]:
import sqlite3
import pandas as pd

In [13]:
conn = sqlite3.connect('../Database/bank.db')

In [6]:
cursor = conn.cursor()
cursor.execute("SELECT * FROM Employees LIMIT 5;")
cursor.fetchall()

[(1,
  'Cory',
  'Lara',
  'Customer Service',
  'Management',
  11,
  '2018-08-12',
  12268.61),
 (2, 'Carl', 'Murray', 'Teller', 'IT', 13, '2018-04-07', 9074.62),
 (3,
  'Deborah',
  'Blair',
  'Credit Officer',
  'Operations',
  5,
  '2019-07-22',
  6456.46),
 (4, 'Carolyn', 'Ramos', 'IT Officer', 'IT', 7, '2020-03-10', 1469.32),
 (5,
  'Amanda',
  'Whitehead',
  'Customer Service',
  'Customer Service',
  15,
  '2016-02-08',
  5149.36)]

In [14]:
# By pandas read_sql
Employees = pd.read_sql('SELECT * FROM Employees',conn)
Customers = pd.read_sql('SELECT * FROM Customers',conn)

In [9]:
conn.close()

In [10]:
Employees.head(5)

,employee_id,first_name,last_name,position,department,branch_id,hire_date,salary
0,1,Cory,Lara,Customer Service,Management,11,2018-08-12,12268.61
1,2,Carl,Murray,Teller,IT,13,2018-04-07,9074.62
2,3,Deborah,Blair,Credit Officer,Operations,5,2019-07-22,6456.46
3,4,Carolyn,Ramos,IT Officer,IT,7,2020-03-10,1469.32
4,5,Amanda,Whitehead,Customer Service,Customer Service,15,2016-02-08,5149.36

In [ ]:
# Number of missing data in the Employees table
Employees.isnull().sum()
# The salary column has 42 missing values

employee_id     0
first_name      0
last_name       0
position        0
department      0
branch_id       0
hire_date       0
salary         42
dtype: int64

In [15]:
# Number of missing data in the Custoemrs table
Customers.isnull().sum()

customer_id      0
first_name       0
last_name        0
dob              0
national_id    158
phone           83
email          295
address          0
branch_id        0
dtype: int64